package javaStudy;
/*Class 클래스
 * 하나의 파일에 2개 이상의 클래스를 작성할 수 있다. -> O
 * 3개의 클래스가 있다면 자바 파일명이 될 수 있는 것은 public 키워드가 붙은 클래스이다. -> O
 * 하나의 파일에 있는 3개의 클래스에 모두 public 키워드를 붙일 수 있다. -> X : 하나만 가능
 * 한 파일 내 3개 이상의 클래스에 모두 public 키워드ㅡㄹ 붙이지 않을 수 있다. -> O
 * 한 파일 내 3개 이상의 클래스에 모두 public 키워드가 없다면 클래스 중 어느 것이라도 파일명이 될 수 있다. -> O
 * 자바 파일에 클래스가 한개 있다며 ㄴ클래스 명이 곧 파일며잉 되어야 한다. -> O
 * */
/*Constructor 생성자
 * 생성자는 new 키워드로 클래스의 객체(또는 인스턴스)가 생성될 때 제일 먼저 자동적으로 호출되는 특별한 메서드이다.
 * 따라서 객체의 초기값을 설정하는 등의 용도로 많이 사용된다.
 * 생성자명은 클래스명과 동일하게 만든다.
 * 생성자는 리턴되는 반환값이 없다. -> 색체가 생성될 때 제일 먼저 호출만 된다.
 * 생성자는 오버로딩이 가능하다.
 * 생성자는 default 생성자라는 것이 있다. -> 클래스 내에 생성자가 없다면 default 생성자가 자동 호출 -> 클래스명과 동일하고 받는 인자값 X
 * 
 * 보통 속성과 메서드 사이에 기술한다.
 * 생성자도 메서드이므로 메서드 그룹에 속하는데 보통 제일 상단에 위차한다.
 * 
 * */
public class OopClass001 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
//		//1. 속성
//		int age;
//		String name;
//		
//		//2. 생성자
//		Person(){}
//		
//		//3. 메서드
//		void move() {
//			System.out.println("Person is moving >>> ");
//		}

	}//main

}//class
